[
    {
        "title": "Frameworks for Effective Problem Solving",
        "description": "Master the art of structured thinking to tackle complex challenges effectively. This course covers essential frameworks like SMART, MECE, and Issue Trees, guiding you in defining and solving problem statements while avoiding common pitfalls. Learn practical, step-by-step methods to enhance decision-making and problem-solving skills.",
        "instructor": "Ajoy Singh - Chief AI Officer, Fractal Analytics",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.9/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/frameworks-for-effective-problem-solving"
    },
    {
        "title": "Anyone can Build AI Agents - Free Course",
        "description": "",
        "instructor": "Apoorv Vishnoi - Head of Training, Analytics Vidhya",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/your-ultimate-guide-to-becoming-an-agentic-ai-expert-by-2025"
    },
    {
        "title": "A Comprehensive Learning Path to Become a Data Analyst in 2025",
        "description": "Where do I begin? Data Analyst is such a huge field - where do you even start learning about Data Analyst?",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "2 Hours",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/a-comprehensive-learning-path-to-become-a-data-analyst-in-2025"
    },
    {
        "title": "Reimagining GenAI: Common Mistakes and Best Practices for Success",
        "description": "Generative AI is transforming industries, but implementation challenges often hinder its success. This course, led by experienced GenAI expert Shabazz Mohammed, dives deep into the pitfalls of adopting generative AI and provides actionable best practices to overcome them.",
        "instructor": "Shahebaz Mohammad - Applied Machine Learning Engineer at Snorkel AI",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/reimagining-genai-common-mistakes-and-best-practices-for-success"
    },
    {
        "title": "Coding a ChatGPT-style Language Model from Scratch in PyTorch",
        "description": "Master the art of building a ChatGPT-style language model from scratch with PyTorch. In this course, you'll explore essential NLP concepts, implement transformers, and create a decoder-only architecture step-by-step. Guided by expert tutorials, gain practical skills to develop advanced AI models tailored for real-world applications.",
        "instructor": "Dr. Joshua Starmer - Co-Founder and CEO of Statsquest",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/coding-a-chatgpt-style-language-model-from-scratch-in-pytorch"
    },
    {
        "title": "Mastering Multilingual GenAI Open-Weights for Indic Languages",
        "description": "Mastering Multilingual GenAI – Open-Weights for Indic Languages\" is a course designed to equip you with the knowledge to develop state-of-the-art multilingual AI models using open-weight architectures. Focusing on low-resource languages, particularly Indic languages, the course covers essential topics like multilingual AI training, instruction fine-tuning, model building, and performance evaluation.",
        "instructor": "Viraat Aryabumi - Research Scholar at Cohere for AI",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/mastering-multilingual-genai-open-weights-for-indic-languages"
    },
    {
        "title": "Learning Autonomous Driving Behaviors with LLMs & RL",
        "description": "This course dives into the development of autonomous driving behaviors using Reinforcement Learning (RL) and Large Language Models (LLMs). You’ll explore how RL agents are trained to navigate complex, real-world environments while making safe, human-like driving decisions. The course tackles key challenges such as designing effective reward systems, ensuring safety in high-speed driving scenarios, and improving the interpretability of AI decisions. Through practical projects, you will design RL agents using techniques like Deep Q-Networks (DQN), experience replay, and integrate LLMs to enhance decision-making.",
        "instructor": "Mayank Baranwal - Senior Scientist at TCS Research | Adjunct Professor at IITB | INAE Young Associate | UIUC | IITK",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.7/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/learning-autonomous-driving-behaviors-with-llms-and-rl"
    },
    {
        "title": "GenAI Applied to Quantitative Finance: For Control Implementation",
        "description": "This course explores the application of Generative AI in quantitative finance, focusing on building sustainable trading algorithms through keyword extraction, sentiment analysis, and time-series forecasting. Learn to predict commodity prices, such as gold, by integrating data from financial news sources, leveraging sentiment analysis, and optimizing models for robust trading signals.",
        "instructor": "Sidharth Kumar, Principal Data Scientist at Intuit",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.7/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/genai-applied-to-quantitative-finance-for-control-implementation"
    },
    {
        "title": "Navigating LLM Tradeoffs: Techniques for Speed, Cost, Scale & Accuracy",
        "description": "This course provides a concise guide to optimizing Large Language Models (LLMs) by navigating tradeoffs in speed, cost, scale, and accuracy. Learn practical techniques like LoRA, model quantization, and parameter-efficient fine-tuning to improve performance while reducing costs. You'll explore various deployment strategies and understand how to evaluate LLMs using industry-standard benchmarks, making this course ideal for anyone seeking efficient, scalable AI solutions.",
        "instructor": "Kartik Nighania - MLOps Engineer at Typewise|Certified AWS Cloud and Kubernetes Engineer",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/navigating-llm-tradeoffs-techniques-for-speed-cost-scale-and-accuracy"
    },
    {
        "title": "Creating Problem-Solving Agents using GenAI for Action Composition",
        "description": "This introductory course provides a concise overview of Agentic AI systems, covering their evolution, current state, and practical applications. You will explore key topics including the history of Agentic AI systems, the role of agents today, multi-agent systems, and practical solutions for implementing them. Perfect for those seeking a foundational understanding of intelligent Agentic AI systems in action.",
        "instructor": "Vikas Agrawal - Senior Principal Data Scientist at Oracle Analytics Cloud",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/creating-problem-solving-agents-using-genai-for-action-composition"
    },
    {
        "title": "Improving Real World RAG Systems: Key Challenges & Practical Solutions",
        "description": "This course explores the key challenges in building real-world Retrieval-Augmented Generation (RAG) systems and provides practical solutions. Topics include improving data retrieval, dealing with hallucinations, context selection, and optimizing system performance using advanced prompting, retrieval strategies, and evaluation techniques. Through hands-on demos, you will gain insights into better chunking, embedding models, and agentic RAG systems for more robust, real-world applications.",
        "instructor": "Dipanjan Sarkar - Head of Community and Principal AI Scientist, Analytics Vidhya",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/improving-real-world-rag-systems-key-challenges"
    },
    {
        "title": "Framework to Choose the Right LLM for your Business",
        "description": "This course will guide you through the process of selecting the most suitable Large Language Model (LLM) for various business needs. By examining factors such as accuracy, cost, scalability, and integration, you will understand how different LLMs perform in specific scenarios, from customer support to healthcare and strategy development. The course emphasizes practical decision-making with real-world case studies, helping businesses navigate the rapidly evolving LLM landscape effectively.",
        "instructor": "Rohan Rao - Principal Data Scientist, H2O.ai; Quadruple Kaggle Grandmaster",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/choosing-the-right-LLM-for-your-business"
    },
    {
        "title": "Building Smarter LLMs with Mamba and State Space Model",
        "description": "Unlock the Power of State Space Models (SSM) like Mamba with our comprehensive course designed for AI professionals, data scientists, and NLP enthusiasts. Master the art of integrating SSM with deep learning, unravel the complexities of models like Mamba, and elevate your understanding of Generative AI's newest and most innovative models. This course is designed to equip you with the skills needed to understand these cutting-edge AI models and how they work, making you proficient in the latest AI techniques and architectures.",
        "instructor": "Maarten Grootendorst - Senior Clinical Data Scientist, IKNL; Creator of KeyBERT and BERTopic",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/building-smarter-llms-with-mamba-and-state-space-model"
    },
    {
        "title": "Generative AI - A Way of Life - Free Course",
        "description": "This course is a transformative journey tailored for beginners and delves into AI-powered text and image generation using leading tools like ChatGPT, Microsoft Copilot, and DALL·E3. Learn practical applications across industries, ethical considerations, and best practices. Whether you're a content creator, business innovator, or AI enthusiast, gain the expertise to harness Generative AI's full potential and drive innovation in your field.",
        "instructor": "Here are some additional free courses you can dive into to fuel your next steps!",
        "stats": {
            "duration": "6 Hours",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/genai-a-way-of-life"
    },
    {
        "title": "Building LLM Applications using Prompt Engineering - Free Course",
        "description": "This course will provide you with a hands-on understanding of building LLM applications and mastering prompt engineering techniques. By the end of the course, you will be proficient in implementing and fine-tuning these techniques to enhance generative AI model performance. You'll learn to apply various prompting methods and build chatbots on enterprise data, equipping you with the skills to improve conversational AI systems in real-world projects.",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "2.1 Hours",
            "rating": "4.6/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/building-llm-applications-using-prompt-engineering-free"
    },
    {
        "title": "Building Your First Computer Vision Model - Free Course",
        "description": "This course will help you gain a deep understanding of Computer Vision and build advanced CV models using the PyTorch framework. With a carefully curated list of resources and exercises, this course is your guide to becoming a Computer Vision expert. Master the techniques to build convolutional neural networks, and classify images.",
        "instructor": "Apoorv Vishnoi, Head - Training Vertical, Analytics Vidhya",
        "stats": {
            "duration": "34 Mins",
            "rating": "4.6/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/building-your-first-computer-vision-model"
    },
    {
        "title": "Bagging and Boosting ML Algorithms - Free Course",
        "description": "This course will provide you with a hands-on understanding of Bagging and Boosting techniques in machine learning. By the end of the course, you will be proficient in implementing and tuning these ensemble methods to enhance model performance. You'll learn to apply algorithms like Random Forest, AdaBoost, and Gradient Boosting to a real-world dataset, equipping you with the skills to improve predictive accuracy and robustness in your projects.",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/bagging-boosting-ML-Algorithms"
    },
    {
        "title": "MidJourney: From Inspiration to Implementation - Free Course",
        "description": "This course will provide you with a practical understanding of MidJourney tools. By the end of the course, you will be able to utilize MidJourney effectively and explore alternative tools for your creative projects. You'll learn how to draw inspiration, use MidJourney's features, and understand its applications through engaging lessons.",
        "instructor": "Sandeep Singh, Expert Senior Director, Bain & Company",
        "stats": {
            "duration": "33 Mins",
            "rating": "4.6/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/midjourney_from_inspiration_to_implementation"
    },
    {
        "title": "Understanding Linear Regression - Free Course",
        "description": "This free course will help you understand the fundamentals of linear regression in a straightforward manner. By the end of this course, you will be able to build predictive models using linear regression techniques. With a carefully curated list of resources and exercises, this course serves as your comprehensive guide to mastering linear regression.",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/free-understanding-linear-regression"
    },
    {
        "title": "The Working of Neural Networks - Free Course",
        "description": "This free course will help you understand the end-to-end working of neural networks in a simple manner. By the end of this course, you will be able to build advanced Deep Learning models using the PyTorch framework. With a carefully curated list of resources and exercises, this course serves as your comprehensive guide to mastering deep learning. It is recommended that you complete the advanced Machine Learning course before taking up this course.",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/the-working-of-neural-networks"
    },
    {
        "title": "The A to Z of Unsupervised ML - Free Course",
        "description": "Unsupervised machine learning helps uncover hidden patterns and structures in data without labeled examples. It is essential for exploratory data analysis, reducing dimensionality, and discovering intrinsic relationships within datasets. Mastering unsupervised techniques enhances data preprocessing and drives insights in complex datasets where labels are scarce or unavailable.",
        "instructor": null,
        "stats": {
            "duration": "52 Mins",
            "rating": "4.6/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/free-unsupervised-ml-guide"
    },
    {
        "title": "Building Your first RAG System using LlamaIndex - Free Course",
        "description": "This course will guide you through building your first Retrieval-Augmented Generation (RAG) system using LlamaIndex. You will start with data ingestion by loading a file into the system, followed by indexing the data for efficient retrieval. Next, you will set up retrieval configurations and use a response synthesizer to combine data into a coherent response. Finally, you will employ a query engine to generate responses. By the end of this course, you will have a solid understanding of these processes and be able to build an RAG system using LlamaIndex code effectively.",
        "instructor": "Prashant Sahu, Ph.D IIT Bombay; Data Science Manager, Analytics Vidhya",
        "stats": {
            "duration": "1.1 Hours",
            "rating": "4.8/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/building-first-rag-systems-using-llamaindex"
    },
    {
        "title": "Data Preprocessing on a Real-World Problem Statement - Free Course",
        "description": "This course will help you get a practical understanding of Data Preprocessing. After this course, you can work on any data and prepare it for modelling. With a carefully curated list of resources, this course is your first step to becoming a Data Scientist. By the end of the course, you will have mastered techniques like EDA and Missing Value Treatment.",
        "instructor": "Include a list of items to support the central theme of your page. Bulleted lists are a great way to parse information into digestible pieces.",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/data-preprocessing"
    },
    {
        "title": "Exploring Stability.AI - Free Course",
        "description": "This course will give you a practical understanding of Stability.AI tools. By the end of the course, you will be able to deploy and customize SD WebUI, and use the Automatic1111 WebUI on RunPod GPU environments. You'll learn to install, set up, generate, and fine-tune SD WebUI settings, equipping you with the skills to harness Stability.AI's full potential for your projects.",
        "instructor": "Sandeep Singh, Expert Senior Director, Bain & Company",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.5/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/exploring-stability-ai"
    },
    {
        "title": "Building a Text Classification Model with Natural Language Processing - Free Course",
        "description": "Gain practical insights into Natural Language Processing (NLP) with our comprehensive course. Learn to build NLP models using PyTorch, delve into classification models, and apply techniques like bag-of-words, count vectorizer and so on. Perfect for professionals seeking to enhance their skills and aspiring students entering the tech industry.",
        "instructor": "Apoorv Vishnoi, Head - Training Vertical, Analytics Vidhya",
        "stats": {
            "duration": "70 Mins",
            "rating": "4.7/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/free-building-textclassification-natural-language-processing"
    },
    {
        "title": "Getting Started with Large Language Models",
        "description": "This course will help you gain a comprehensive understanding of Large Language Models (LLMs) and develop advanced natural language processing (NLP) applications using the PyTorch framework. With a carefully curated list of resources and exercises, this course is your guide to becoming an expert in LLMs. Master the techniques to build and fine-tune LLMs, and generate human-like text.",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "1.2 Hours",
            "rating": "4.5/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/getting-started-with-llms"
    },
    {
        "title": "Introduction to Generative  AI",
        "description": "This course will provide you with a comprehensive understanding of generative AI, including text and image generation techniques. By the end of the course, you will be have an understanding of using generative AI tools to create diverse content. You'll learn how generative AI works, engage in practical exercises, and gain the skills to implement these techniques in real-world projects.",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-generative-ai"
    },
    {
        "title": "Nano Course: Dreambooth-Stable Diffusion for Custom Images",
        "description": "Have you ever wondered how to turn your dreams into reality by creating images of your dog traveling around the world or yourself alongside Elon Musk or playing cricket with MSD?",
        "instructor": "Sandeep Singh, Head of Applied AI/Computer Vision at Beans.ai",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.6/5",
            "level": "Advanced"
        },
        "url": "https://courses.analyticsvidhya.com/courses/nano-course-dreambooth-stable-diffusion-for-custom-images"
    },
    {
        "title": "A Comprehensive Learning Path for Deep Learning in 2023",
        "description": "The most common question we get from beginners in the field of Deep Learning is - Where to begin? The journey to becoming a Deep Learning expert can be difficult if one does not have the right resources to follow. There are a million resources to refer and it is tough to decide where to start from.",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/a-comprehensive-learning-path-for-deep-learning-in-2023"
    },
    {
        "title": "A Comprehensive Learning Path to Become a Data Scientist in 2024",
        "description": "Where do I begin? Data science is such a huge field - where do you even start learning about Data Science?",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "2 Hours",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/a-comprehensive-learning-path-to-become-a-data-scientist-in-twenty-twenty-four"
    },
    {
        "title": "Nano Course: Building Large Language Models for Code",
        "description": "In this Free Nano GenAI Course on Building Large Language Models for Code, you will-",
        "instructor": "Loubna Ben Allal, ML Engineer at Hugging Face",
        "stats": {
            "duration": "38 Mins",
            "rating": "4.7",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/building-large-language-models-for-code"
    },
    {
        "title": "Machine Learning Summer Training",
        "description": "This is the second step of the Machine Learning Summer Training, want to know more click here.",
        "instructor": "Now that you get the hang of it, you might be asking what are some of the examples of machine learning and how does it affect our life? Here are a few examples where we use the outcome of machine learning already:",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/machine-learning-summer-training"
    },
    {
        "title": "AI Ethics by Fractal",
        "description": "AI has a huge influence on our lives. From typing on our smartphones, to personalized recommendations on our favourite shopping websites, intelligent machines are everywhere. Our interactions with technology have become more personalized, but with humans ultimately behind these creations, the question is: where does the responsibility lie? Why and how should we begin the AI ethics conversation at Fractal?",
        "instructor": "We are there for your support when you need!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/ai-ethics-fractal"
    },
    {
        "title": "A Comprehensive Learning Path to Become a Data Engineer in 2022",
        "description": "Where do I begin? Data Engineering is such a huge field - where do you even start learning about Data Engineering?",
        "instructor": "The course is ideal for beginners in the field of Data Engineering. Several features which make it exciting are:",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/a-comprehensive-learning-path-to-become-a-data-engineer-in-2022"
    },
    {
        "title": "Applied Machine Learning - Beginner to Professional",
        "description": "Machine Learning is re-shaping and revolutionising the world and disrupting industries and job functions globally. It is no longer a buzzword - many different industries have already seen automation of business processes and disruptions from Machine Learning. In this age of machine learning, every aspiring data scientist is expected to upskill themselves in machine learning techniques & tools and apply them in real-world business problems.",
        "instructor": "We are there for your support when you need!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/applied-machine-learning-beginner-to-professional"
    },
    {
        "title": "Ace Data Science Interviews",
        "description": "Are you trying to get into data science roles but getting rejected by employers? Are you scared of getting into data science interviews? Or don't know what to expect in data science interviews? This is just the course you need.",
        "instructor": "We are there for your support when you need!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/ace-data-science-interviews"
    },
    {
        "title": "Writing Powerful Data Science Articles",
        "description": "\"Either write something worth reading or do something worth writing.\" - Benjamin Franklin",
        "instructor": null,
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/writing-powerful-data-science-articles"
    },
    {
        "title": "Machine Learning Certification Course for Beginners",
        "description": "Machine Learning is the science of teaching machines how to learn by themselves. Machine Learning is reshaping and revolutionizing the world and disrupting industries and job functions globally.",
        "instructor": "1. Customer Churn Prediction",
        "stats": {
            "duration": "6 Hours",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/Machine-Learning-Certification-Course-for-Beginners"
    },
    {
        "title": "Data Science Career Conclave - Transition to Data Science!",
        "description": "It feels like half the world wants to move into data science these days, with spectacular perks and a plethora of openings on offer in the industry. Organizations are investing heavily in data science talent to stay or move ahead of their competitors. As a data science aspirant, you couldn’t have picked a better time to change your career!",
        "instructor": "You’ve come to the right place!",
        "stats": {}
    },
    {
        "title": "Top Data Science Projects for Analysts and Data Scientists",
        "description": "This is a very common question interviewers ask in data science interviews. We have conducted hundreds of these interviews for both data analyst and data scientist roles and this is quite often the jackpot question. This is especially true if you’re a fresher or a relative newcomer to data science.",
        "instructor": "“How many data science projects have you completed so far?”",
        "stats": {
            "rating": "4.6/5",
            "level": "Advanced"
        },
        "url": "https://courses.analyticsvidhya.com/courses/top-data-science-projects-for-analysts-and-data-scientists"
    },
    {
        "title": "Getting Started with Git and GitHub for Data Science Professionals",
        "description": "Ever heard of version control? It is one of the most important concepts in a data scientist’s daily role - and yet most newcomers and beginners haven’t even come across it! This is a fallacy you must overcome as soon as possible.",
        "instructor": "This course is for anyone who:",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/getting-started-with-git-and-github-for-data-science-professionals"
    },
    {
        "title": "Data Science Hacks, Tips and Tricks",
        "description": "The Data Science Hacks, Tips and Tricks course is your one stop destination to become a better and more efficient data scientist!",
        "instructor": "Common questions related to the Data Science Hacks, Tips and Tricks course",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/data-science-hacks-tips-and-tricks"
    },
    {
        "title": "Introduction to Business Analytics",
        "description": "Getting Started with Business Analytics",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "1 Hour",
            "rating": "4.6/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-analytics"
    },
    {
        "title": "Introduction to PyTorch for Deep Learning",
        "description": "Welcome to the world of PyTorch - a deep learning framework that has changed and re-imagined the way we build deep learning models.",
        "instructor": null,
        "stats": {
            "duration": "1 Hour",
            "rating": "4.6/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-pytorch-for-deeplearning"
    },
    {
        "title": "Introduction to Natural Language Processing",
        "description": "Natural Language Processing is the art of extracting information from unstructured text. Learn basics of Natural Language Processing, Regular Expressions & text sentiment analysis using machine learning in this course.",
        "instructor": null,
        "stats": {
            "duration": "5 Hours",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/Intro-to-NLP"
    },
    {
        "title": "Getting started with Decision Trees",
        "description": "A Decision Tree is a flowchart like structure, where each node represents a decision, each branch represents an outcome of the decision, and each terminal node provides a prediction / label.",
        "instructor": "Getting Started with Decision Trees",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/getting-started-with-decision-trees"
    },
    {
        "title": "Introduction to Python",
        "description": "Do you want to enter the field of Data Science? Are you intimidated by the coding you would need to learn? Are you looking to learn Python to switch to a data science career?",
        "instructor": null,
        "stats": {
            "duration": "1 Hour",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-data-science"
    },
    {
        "title": "Loan Prediction Practice Problem (Using Python)",
        "description": "This course is designed for people who want to solve binary classification problems. Classification is a skill every Data Scientist should be well versed in.",
        "instructor": null,
        "stats": {
            "rating": "4.7/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/loan-prediction-practice-problem-using-python"
    },
    {
        "title": "Big Mart Sales Prediction Using R",
        "description": "Sales prediction is a very common real life problem that each company faces at least once in its life time. If done correctly, it can have a significant impact on the success and performance of that company.",
        "instructor": null,
        "stats": {
            "rating": "4.6/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/big-mart-sales-prediction-using-r"
    },
    {
        "title": "Twitter Sentiment Analysis",
        "description": "",
        "instructor": null,
        "stats": {
            "rating": "4.7/5",
            "level": "Intermediate"
        },
        "url": "https://courses.analyticsvidhya.com/courses/twitter-sentiment-analysis"
    },
    {
        "title": "Pandas for Data Analysis in Python",
        "description": "Pandas is one of the most popular Python libraries in data science. In fact, Pandas is among those elite libraries that draw instant recognition from programmers of all backgrounds, from developers to data scientists.",
        "instructor": "This free course by Analytics Vidhya will introduce you to the world of Pandas in Python, how you can use Pandas to perform data analysis and data manipulation. The perfect starting course for Python and Pandas beginners!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/pandas-for-data-analysis-in-python"
    },
    {
        "title": "Support Vector Machine (SVM) in Python and R",
        "description": "Want to learn the popular machine learning algorithm - Support Vector Machines (SVM)? Support Vector Machines can be used to build both Regression and Classification Machine Learning models.",
        "instructor": "This free course by Analytics Vidhya will provide you with a solid introduction to Support Vector Machines (SVM) and how this popular machine learning algorithm works under the hood. We will also implement SVM in Python and R to give you a practical understanding of this algorithm. A perfect course in your machine learning journey!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/support-vector-machine-svm-in-python-and-r"
    },
    {
        "title": "Evaluation Metrics for Machine Learning Models",
        "description": "Evaluation metrics form the backbone of improving your machine learning model. Without these evaluation metrics, we would be lost in a sea of machine learning model scores - unable to understand which model is performing well.",
        "instructor": "You will learn all about evaluation metrics for machine learning models in this course. We will discuss the different types of evaluation metrics, including how to use them for evaluating classification and regression models.",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/evaluation-metrics-for-machine-learning-models"
    },
    {
        "title": "Fundamentals of Regression Analysis",
        "description": "Linear regression and logistic regression are typically the first algorithms we learn in data science. These are two key concepts not just in machine learning, but in statistics as well.",
        "instructor": "In this free course, you will build a solid understanding of what regression is and the different types of regression techniques out there. You will also get a taste of how regression analysis works, the different assumptions you would need to make in regression analysis, and yes, we will answer the linear regression vs logistic regression question!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/Fundamentals-of-Regression-Analysis"
    },
    {
        "title": "Getting Started with scikit-learn (sklearn) for Machine Learning",
        "description": "Scikit-learn, or sklearn for short, is the first Python library we turn to when building machine learning models. Sklearn is unanimously the favorite Python library among data scientists. As a newcomer to machine learning, you should be comfortable with sklearn and how to build ML models, including:",
        "instructor": "This is where you seal the deal. Sprinkle this section throughout your page to push prospects to purchase!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/get-started-with-scikit-learn-sklearn"
    },
    {
        "title": "Convolutional Neural Networks (CNN) from Scratch",
        "description": "Convolutional Neural Networks, or CNN as they’re popularly called, are the go-to deep learning architecture for computer vision tasks, such as object detection, image segmentation, facial recognition, among others. CNNs have even been extended to the field of video analysis!",
        "instructor": null,
        "stats": {
            "rating": "4.7/5",
            "level": "Advanced"
        },
        "url": "https://courses.analyticsvidhya.com/courses/convolutional-neural-networks-cnn-from-scratch"
    },
    {
        "title": "Dimensionality Reduction for Machine Learning",
        "description": "Have you worked on a dataset with more than a thousand features? How about 40,000 features? We are generating data at an unprecedented pace right now and working with massive datasets in machine learning projects is becoming mainstream.",
        "instructor": "",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/dimensionality-reduction-for-machine-learning"
    },
    {
        "title": "K-Nearest Neighbors (KNN) Algorithm in Python and R",
        "description": "K-Nearest Neighbor (KNN) is one of the most popular machine learning algorithms. As a newcomer or beginner in machine learning, you’ll find KNN to be among the easiest algorithms to pick up.",
        "instructor": "",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/K-Nearest-Neighbors-KNN-Algorithm"
    },
    {
        "title": "Ensemble Learning and Ensemble Learning Techniques",
        "description": "Ensemble learning is a powerful machine learning algorithm that is used across industries by data science experts. The beauty of ensemble learning techniques is that they combine the predictions of multiple machine learning models. You must have used or come across several of these ensemble learning techniques in your machine learning journey:- Bagging- Boosting- Stacking- Blending, etc. These ensemble learning techniques include popular machine learning algorithms such as XGBoost, Gradient Boosting, among others. You must be getting a good idea of how vast and useful ensemble learning can be!",
        "instructor": "Common questions related to the Convolutional Neural Networks (CNN) from Scratch course",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/ensemble-learning-and-ensemble-learning-techniques"
    },
    {
        "title": "Linear Programming for Data Science Professionals",
        "description": "Optimization is the way of life. We all have finite resources and time and we want to make the most of them. From using your time productively to solving supply chain problems for your company – everything uses optimization.",
        "instructor": "Common questions related to the Introduction to Linear Programming for Data Science Professionals course",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/linear-programming"
    },
    {
        "title": "Naive Bayes from Scratch",
        "description": "Naive Bayes ranks in the top echelons of the machine learning algorithms pantheon. It is a popular and widely used machine learning algorithm and is often the go-to technique when dealing with classification problems.",
        "instructor": null,
        "stats": {
            "duration": "30 Mins",
            "rating": "4.6/5",
            "level": "Advanced"
        },
        "url": "https://courses.analyticsvidhya.com/courses/naive-bayes"
    },
    {
        "title": "Learn Swift for Data Science",
        "description": "he Swift programming language is quickly becoming the language of choice for a lot of data science experts and professionals. Swift’s flexibility, ease of use, excellent documentation, and quick execution speed are key reasons behind the language’s recent prominence in the data science space.",
        "instructor": "In this free course on Swift for Data Science, we will learn about Swift as a programming language and how it fits into the data science space. If you’re a Python user, you’ll notice the subtle differences and the incredible similarities between the two. We showcase Swift code as well in the course so get started!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/learn-swift-for-data-science"
    },
    {
        "title": "Introduction to Web Scraping using Python",
        "description": "The need and importance of extracting data from the web is becoming increasingly loud and clear. There is an unprecedented volume of data on the internet right now - and data science projects often need this data to build predictive models.",
        "instructor": "This is where you seal the deal. Sprinkle this section throughout your page to push prospects to purchase!",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-web-scraping"
    },
    {
        "title": "Tableau for Beginners",
        "description": "Tableau is the gold standard in business intelligence, analytics and data visualization tools. Tableau Desktop (and now Tableau Public) have transformed the way we interact with visualizations and tell data stories to our clients, stakeholders, and to non-technical audiences around the world.",
        "instructor": null,
        "stats": {
            "duration": "15 Mins",
            "rating": "4.6/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/tableau-for-beginners"
    },
    {
        "title": "Getting Started with Neural Networks",
        "description": "What is a neural network? How does it work? What does a neural network do? Learn neural networks for free in this course and get your neural network questions answered, including applications of neural networks in deep learning.",
        "instructor": "Kunal Jain, Founder & CEO, Analytics Vidhya",
        "stats": {
            "duration": "70 Mins",
            "rating": "4.7/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/getting-started-with-neural-networks"
    },
    {
        "title": "Introduction to AI & ML",
        "description": "Analytics Vidhya’s ‘Introduction to AI and ML’ course, curated and delivered by experienced instructors with decades of industry experience between them, will help you understand the answers to these pressing questions.",
        "instructor": "",
        "stats": {
            "duration": "2 Hours",
            "rating": "4.8/5",
            "level": "Beginner"
        },
        "url": "https://courses.analyticsvidhya.com/courses/introduction-to-ai-ml"
    },
    {
        "title": "Winning Data Science Hackathons - Learn from Elite Data Scientists",
        "description": "There is no substitute for experience. And that holds true in Data Science competitions as well. These cut-throat hackathons require a lot of trial-and-error, effort, and dedication to reach the ranks of the elite.",
        "instructor": "",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/winning-data-science-hackathons-learn-from-elite-data-scientists"
    },
    {
        "title": "Hypothesis Testing for Data Science and Analytics",
        "description": "Statistics is the study of the collection, analysis, interpretation, presentation, and organisation of data. For all the data science and machine learning enthusiasts it is paramount to be well versed with various statistical concepts such as Hypothesis testing",
        "instructor": "T",
        "stats": {},
        "url": "https://courses.analyticsvidhya.com/courses/hypothesis-testing-for-data-science-and-analytics"
    }
]